In [2]:
#Pandas Series
#diffrences between numpy array and pandas series
#1.Diffrent types are allowed in pandas series
#2.Series has a name
#3.At the backend there is numpy present
#4.You can create manual indices in pandas series

In [3]:
import numpy as np
import pandas as pd

In [4]:
sample = pd.Series([12.00, 11, 10.11])
sample

0    12.00
1    11.00
2    10.11
dtype: float64

In [5]:
sample.name = 'Sample'
sample

0    12.00
1    11.00
2    10.11
Name: Sample, dtype: float64

In [6]:
sample.index = [
    'First_Number',
    'Second_Number',
    'Third_Number'
]
sample
#Looks more like a dictionary,but
#Dictionary in Python are unordered 
#Pandas series is ordered

First_Number     12.00
Second_Number    11.00
Third_Number     10.11
Name: Sample, dtype: float64

In [7]:
#You can directly create a series
sample = pd.Series({
    'First':10,
    'Second':100,
    'Third' :1000
})
sample

First       10
Second     100
Third     1000
dtype: int64

In [8]:
sample['Second']

100

In [9]:
#FUNDAMENTAL DIFFERNCE#
#In Python upper limit of slice is not returned.
#In pandas Upper Limit is indeed included.

In [10]:
sample['First':'Second']

First      10
Second    100
dtype: int64

In [11]:
sample[0:1]

First    10
dtype: int64

In [12]:
#Vectorised Opertations are applicable and works in same way as numpy
#Boolean operations are also same

In [13]:
x = pd.Series([1,2,3,4,5,5])
x

0    1
1    2
2    3
3    4
4    5
5    5
dtype: int64

In [14]:
x.mean()

3.3333333333333335

In [15]:
x[x>4]

4    5
5    5
dtype: int64

In [16]:
x>4

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [17]:
x[x>x.mean()]

3    4
4    5
5    5
dtype: int64

In [18]:
#Modifying Series

In [19]:
x[0] = 3
x

0    3
1    2
2    3
3    4
4    5
5    5
dtype: int64

In [20]:
#DATAFRAMES
#Usually created from csv Files
#DataFrame is a combination of Series

In [21]:
#creating a dataframe
sampleDataFrame= pd.DataFrame({
    'Name':['Iron Man', 'Captain America', 'Thor'],
    'Powers':[80,75,98]
})
sampleDataFrame

              Name  Powers
0         Iron Man      80
1  Captain America      75
2             Thor      98

In [22]:
sampleDataFrame['Name']

0           Iron Man
1    Captain America
2               Thor
Name: Name, dtype: object

In [23]:
sampleDataFrame.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
sampleDataFrame.describe()

          Powers
count   3.000000
mean   84.333333
std    12.096832
min    75.000000
25%    77.500000
50%    80.000000
75%    89.000000
max    98.000000

In [25]:
sampleDataFrame.index = ['Super_1', 
                        'Super_2',
                        'Super_3']
sampleDataFrame

                    Name  Powers
Super_1         Iron Man      80
Super_2  Captain America      75
Super_3             Thor      98

In [26]:
#Selecting items in DataFrames

In [27]:
#Selecting rows
sampleDataFrame.loc['Super_1']  #Element by Index

Name      Iron Man
Powers          80
Name: Super_1, dtype: object

In [28]:
sampleDataFrame.iloc[-1] #Element by Position

Name      Thor
Powers      98
Name: Super_3, dtype: object

In [29]:
#Selecting Columns
sampleDataFrame['Powers']

Super_1    80
Super_2    75
Super_3    98
Name: Powers, dtype: int64

In [30]:
sampleDataFrame.loc['Super_1':'Super_2','Powers'] #loc['Start':'end', items to be selected]

Super_1    80
Super_2    75
Name: Powers, dtype: int64

In [31]:
sampleDataFrame.loc['Super_1': 'Super_2', ['Name', 'Powers']]

                    Name  Powers
Super_1         Iron Man      80
Super_2  Captain America      75

In [32]:
sampleDataFrame.loc[sampleDataFrame['Powers'] > 75]

             Name  Powers
Super_1  Iron Man      80
Super_3      Thor      98

In [41]:
#Dropping data
#While Dropping data it is immutable it is not changing the underlying data frame .
sampleDataFrame.drop(columns = 'Powers') #Dropping columns
sampleDataFrame.drop('Super_1') #Droping Rows

                    Name  Powers
Super_2  Captain America      75
Super_3             Thor      98

In [46]:
#Opertions between DataFrames and Series
sampleSeries = pd.Series([10, ' Avenger'] , index = ['Powers', 'Name'])
sampleDataFrame + sampleSeries

                            Name Powers
Super_1         Iron Man Avenger     90
Super_2  Captain America Avenger     85
Super_3             Thor Avenger    108

In [47]:
#Another Type of Operations
_sampleSeries = pd.Series([10,10], index = ['HP', 'Health'])
sampleDataFrame + _sampleSeries

         HP  Health Name  Powers
Super_1 NaN     NaN  NaN     NaN
Super_2 NaN     NaN  NaN     NaN
Super_3 NaN     NaN  NaN     NaN

In [48]:
#Adding new Columns
_hp = pd.Series([80, 85, 100], index = ['Super_1', 'Super_2', 'Super_3'])
sampleDataFrame['HP'] = _hp

In [57]:
sampleDataFrame

                    Name  Powers   HP
Super_1         Iron Man      80   80
Super_2  Captain America      75   85
Super_3             Thor      98  100

In [61]:
#Usually '=' signifies the underlying data is changed

                    Name  Powers   HP
Leader          Iron Man      80   80
Super_2  Captain America      75   85
Super_3             Thor      98  100

In [63]:
#Changing index and columns
sampleDataFrame.rename(
    columns = {
        'HP' : 'Max Power'
    },
    index= {
        'Super_1':'Lead Avenger'
    }
    )
#Again Immutable

                         Name  Powers  Max Power
Lead Avenger         Iron Man      80         80
Super_2       Captain America      75         85
Super_3                  Thor      98        100

In [109]:
sampleDataFrame

                         Name  Powers  Max Power  FIghting Factor
Lead Avenger         Iron Man      80         80         1.000000
Super_2       Captain America      75         85         1.133333
Super_3                  Thor      98        100         1.020408

In [110]:
sampleDataFrame = sampleDataFrame.rename(
    columns = {
        'HP' : 'Max Power'
    },
    index= {
        'Super_1':'Lead Avenger'
    }
    )

In [111]:
sampleDataFrame

                         Name  Powers  Max Power  FIghting Factor
Lead Avenger         Iron Man      80         80         1.000000
Super_2       Captain America      75         85         1.133333
Super_3                  Thor      98        100         1.020408

In [112]:
sampleDataFrame['FIghting Factor'] = sampleDataFrame['Max Power']/sampleDataFrame['Powers']

In [113]:
sampleDataFrame

                         Name  Powers  Max Power  FIghting Factor
Lead Avenger         Iron Man      80         80         1.000000
Super_2       Captain America      75         85         1.133333
Super_3                  Thor      98        100         1.020408

In [114]:
sampleDataFrame

                         Name  Powers  Max Power  FIghting Factor
Lead Avenger         Iron Man      80         80         1.000000
Super_2       Captain America      75         85         1.133333
Super_3                  Thor      98        100         1.020408

In [115]:
#Reading Data From CSV File
#Lets you import data from a external source into your Notebook

In [116]:
pd.read_csv

<function pandas.io.parsers.readers.read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=None, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=None, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression: 'CompressionOptions' = 'infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)>

In [126]:
superHeroes = pd.read_csv('.\characters.csv')

In [127]:
#Prints first five elements
superHeroes.head()

   characterID             name
0      1009220  Captain America
1      1010740   Winter Soldier
2      1009471        Nick Fury
3      1009552     S.H.I.E.L.D.
4      1009228    Sharon Carter

In [119]:
superHeroes.dtypes

characterID     int64
name           object
dtype: object

In [120]:
superHeroes.shape

(1170, 2)

In [121]:
superHeroes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1170 entries, 0 to 1169
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   characterID  1170 non-null   int64
 1   name         1170 non-null   object
dtypes: int64(1), object(1)
memory usage: 18.4+ KB

In [122]:
superHeroes.tail()

      characterID                           name
1165      1011395  Talon (Fraternity of Raptors)
1166      1011196                  Captain Flint
1167      1009397                       Lava-Man
1168      1011113                     Blue Blade
1169      1011094                          Xavin

In [123]:
superHeroes.set_index('characterID', inplace = True)

In [124]:
superHeroes.loc[1011395]

name    Talon (Fraternity of Raptors)
Name: 1011395, dtype: object

In [125]:
superHeroes

                                      name
characterID
1009220                    Captain America
1010740                     Winter Soldier
1009471                          Nick Fury
1009552                       S.H.I.E.L.D.
1009228                      Sharon Carter
...                                    ...
1011395      Talon (Fraternity of Raptors)
1011196                      Captain Flint
1009397                           Lava-Man
1011113                         Blue Blade
1011094                              Xavin

[1170 rows x 1 columns]

In [144]:
_supes = pd.read_csv('.\characters.csv',
                     header= None,
                    names = ['ID', 'Name'],
                    index_col = 0
                    )

In [145]:
_supes

                                      Name
ID
characterID                           name
1009220                    Captain America
1010740                     Winter Soldier
1009471                          Nick Fury
1009552                       S.H.I.E.L.D.
...                                    ...
1011395      Talon (Fraternity of Raptors)
1011196                      Captain Flint
1009397                           Lava-Man
1011113                         Blue Blade
1011094                              Xavin

[1171 rows x 1 columns]

In [163]:
_supes.loc['1010740']

Name    Winter Soldier
Name: 1010740, dtype: object

In [ ]:
#Plotting
#Pandas integrates with Matplotlib Library